In [36]:
import pandas as pd
import numpy as np

In [37]:
bdf = pd.read_csv('resto-asap2018\casc-resto-small.csv', sep = ',')
df =  pd.read_csv('resto-asap2018\casc-resto.csv', sep = ';', decimal = ',')
df

,CustomerID,Restaurant,RKDate,RegionName,BrandsNames,DishCategoryName,Quantity,SummBasic,SummAfterPointsUsage
0,2898197,391,2017-07-16,Москва и Московская область,TGI FRIDAYS,NON ALCOHOL,2,2.00,2.00
1,2903215,43,2015-04-07,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
2,2748887,43,2015-05-22,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
3,2862077,46,2015-03-05,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
4,2862077,46,2015-03-11,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
...,...,...,...,...,...,...,...,...,...
882217,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67
882218,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67
882219,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67
882220,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67
882221,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67

In [38]:
cos = pd.read_csv('resto-asap2018\CASC_Constant.csv', sep = ',')
cos = cos.rename(columns = {'CustomerId' : 'CustomerID'})
cos

,CustomerID,ActivationDate,Age,Sex,SubscribedEmail,SubscribedPush
0,2728183,2015-01-01,21.0,Female,False,True
1,2728198,2015-01-01,21.0,Female,True,True
2,2728306,2015-01-01,21.0,Female,True,True
3,2728178,2015-01-01,22.0,Male,True,True
4,2728322,2015-01-01,22.0,Male,True,True
...,...,...,...,...,...,...
9995,2912655,2015-03-31,49.0,Female,True,True
9996,2912502,2015-03-31,52.0,Male,True,True
9997,2912767,2015-03-31,52.0,Male,True,False
9998,2912383,2015-03-31,60.0,Male,False,False
9999,2912304,2015-03-31,118.0,NaN,False,True

In [39]:
pre_grp = df[df.RKDate <= '2017-07-01']
pre_grp

,CustomerID,Restaurant,RKDate,RegionName,BrandsNames,DishCategoryName,Quantity,SummBasic,SummAfterPointsUsage
1,2903215,43,2015-04-07,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
2,2748887,43,2015-05-22,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
3,2862077,46,2015-03-05,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
4,2862077,46,2015-03-11,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
5,2862077,46,2015-03-13,Москва и Московская область,IL Патио,NON ALCOHOL,1,5.00,5.00
...,...,...,...,...,...,...,...,...,...
882217,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67
882218,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67
882219,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67
882220,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67
882221,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67

In [40]:
user_grp = pre_grp.groupby(['CustomerID'])
user_grp.first()

,Restaurant,RKDate,RegionName,BrandsNames,DishCategoryName,Quantity,SummBasic,SummAfterPointsUsage
CustomerID,,,,,,,,
2728046,54,2015-01-01,Москва и Московская область,TGI FRIDAYS,NON ALCOHOL,1,20.0,20.00
2728088,424,2015-01-26,Москва и Московская область,IL Патио,NON ALCOHOL,1,120.0,120.00
2728089,688,2015-01-01,Москва и Московская область,"IL Патио,Планета Суши",ALCOHOL,2,320.0,320.00
2728095,43,2015-08-23,Москва и Московская область,IL Патио,FOOD,1,30.0,22.40
2728107,393,2017-03-08,Москва и Московская область,IL Патио,FOOD,1,30.0,25.45
...,...,...,...,...,...,...,...,...
2913103,94,2015-05-28,Москва и Московская область,TGI FRIDAYS,NON ALCOHOL,1,25.0,25.00
2913106,127,2015-04-08,Москва и Московская область,IL Патио,NON ALCOHOL,1,30.0,30.00
2913114,55,2015-12-26,Москва и Московская область,TGI FRIDAYS,NON ALCOHOL,1,25.0,25.00
2913123,929,2016-09-26,Москва и Московская область,IL Патио,NON ALCOHOL,1,25.0,25.00
2913132,728,2016-12-07,Москва и Московская область,IL Патио,FOOD,1,289.0,289.00

In [41]:
y_cnt = df[(df.RKDate > '2017-07-01') & (df.RKDate <= '2017-12-31')]
y = []
for i in range(len(y_cnt)):
    y.append(1)
y_cnt['Y'] = y
y_cnt

,CustomerID,Restaurant,RKDate,RegionName,BrandsNames,DishCategoryName,Quantity,SummBasic,SummAfterPointsUsage,Y
0,2898197,391,2017-07-16,Москва и Московская область,TGI FRIDAYS,NON ALCOHOL,2,2.0,2.00,1
209,2767598,450,2017-11-22,Москва и Московская область,Мама Раша,FOOD,1,9.0,7.00,1
271,2910374,43,2017-07-06,Москва и Московская область,IL Патио,FOOD,1,10.0,10.00,1
322,2743625,46,2017-11-07,Москва и Московская область,IL Патио,FOOD,1,10.0,10.00,1
417,2751226,49,2017-08-03,Москва и Московская область,IL Патио,FOOD,1,10.0,8.92,1
...,...,...,...,...,...,...,...,...,...,...
882163,2764432,387,2017-07-15,Москва и Московская область,TGI FRIDAYS,ALCOHOL,6,2814.0,2608.75,1
882167,2876335,449,2017-11-07,Москва и Московская область,TGI FRIDAYS,FOOD,6,2814.0,2669.81,1
882171,2877236,387,2017-12-09,Москва и Московская область,TGI FRIDAYS,FOOD,3,2175.0,1728.87,1
882173,2786174,903,2017-11-01,Москва и Московская область,IL Патио,FOOD,3,2175.0,2124.37,1
882196,2735937,925,2017-08-03,Москва и Московская область,"IL Патио,Планета Суши",ALCOHOL,1,1399.9,1399.90,1

In [42]:
new_df = pd.merge(y_cnt, df, how = 'outer', on = ['CustomerID', 'Restaurant', 'RKDate', 'RegionName', 'BrandsNames', 'DishCategoryName', 'Quantity', 'SummBasic', 'SummAfterPointsUsage'])
new_df = new_df.fillna(0)
new_df

,CustomerID,Restaurant,RKDate,RegionName,BrandsNames,DishCategoryName,Quantity,SummBasic,SummAfterPointsUsage,Y
0,2898197,391,2017-07-16,Москва и Московская область,TGI FRIDAYS,NON ALCOHOL,2,2.00,2.00,1.0
1,2767598,450,2017-11-22,Москва и Московская область,Мама Раша,FOOD,1,9.00,7.00,1.0
2,2910374,43,2017-07-06,Москва и Московская область,IL Патио,FOOD,1,10.00,10.00,1.0
3,2743625,46,2017-11-07,Москва и Московская область,IL Патио,FOOD,1,10.00,10.00,1.0
4,2751226,49,2017-08-03,Москва и Московская область,IL Патио,FOOD,1,10.00,8.92,1.0
...,...,...,...,...,...,...,...,...,...,...
906649,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67,0.0
906650,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67,0.0
906651,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67,0.0
906652,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67,0.0
906653,2811717,922,2016-01-07,Москва и Московская область,"IL Патио,Планета Суши",FOOD,1,57.67,57.67,0.0

In [43]:
new_df = new_df.drop_duplicates(['CustomerID'])
new_df

,CustomerID,Restaurant,RKDate,RegionName,BrandsNames,DishCategoryName,Quantity,SummBasic,SummAfterPointsUsage,Y
0,2898197,391,2017-07-16,Москва и Московская область,TGI FRIDAYS,NON ALCOHOL,2,2.0,2.00,1.0
1,2767598,450,2017-11-22,Москва и Московская область,Мама Раша,FOOD,1,9.0,7.00,1.0
2,2910374,43,2017-07-06,Москва и Московская область,IL Патио,FOOD,1,10.0,10.00,1.0
3,2743625,46,2017-11-07,Москва и Московская область,IL Патио,FOOD,1,10.0,10.00,1.0
4,2751226,49,2017-08-03,Москва и Московская область,IL Патио,FOOD,1,10.0,8.92,1.0
...,...,...,...,...,...,...,...,...,...,...
620658,2904785,440,2015-07-21,Москва и Московская область,TGI FRIDAYS,FOOD,1,265.0,265.00,0.0
634121,2832618,906,2017-03-15,Москва и Московская область,IL Патио,FOOD,1,425.0,425.00,0.0
660976,2751028,492,2015-01-25,Москва и Московская область,Costa Coffee,NON ALCOHOL,1,245.0,245.00,0.0
661026,2889022,492,2016-07-08,Москва и Московская область,Costa Coffee,NON ALCOHOL,1,245.0,245.00,0.0
724977,2744732,934,2015-01-16,Москва и Московская область,"IL Патио,Планета Суши",NON ALCOHOL,1,75.0,75.00,0.0

In [44]:
new_df = new_df[['CustomerID', 'Y']]
new_df.drop_duplicates()
new_df

        CustomerID    Y
0          2898197  1.0
1          2767598  1.0
2          2910374  1.0
3          2743625  1.0
4          2751226  1.0
...            ...  ...
620658     2904785  0.0
634121     2832618  0.0
660976     2751028  0.0
661026     2889022  0.0
724977     2744732  0.0

[10000 rows x 2 columns]

In [45]:
group_rec = pre_grp[['CustomerID', 'RKDate']].groupby('CustomerID')['RKDate'].max()
group_rec = group_rec.to_frame()
group_rec

                RKDate
CustomerID
2728046     2017-01-22
2728088     2015-07-12
2728089     2017-06-16
2728095     2017-01-05
2728107     2017-03-08
...                ...
2913103     2016-05-26
2913106     2017-02-25
2913114     2017-03-28
2913123     2017-06-23
2913132     2017-05-18

[9939 rows x 1 columns]

In [46]:
new_df = pd.merge(new_df, group_rec, how = 'outer', on = 'CustomerID')
new_df = new_df.fillna('2017-07-01')
new_df

      CustomerID    Y      RKDate
0        2898197  1.0  2017-07-01
1        2767598  1.0  2017-04-07
2        2910374  1.0  2017-06-30
3        2743625  1.0  2017-06-29
4        2751226  1.0  2017-02-15
...          ...  ...         ...
9995     2904785  0.0  2015-08-08
9996     2832618  0.0  2017-04-08
9997     2751028  0.0  2015-01-30
9998     2889022  0.0  2016-08-29
9999     2744732  0.0  2016-02-16

[10000 rows x 3 columns]

In [47]:
new_df = new_df.rename(columns = {"RKDate" : "Recency"})
new_df

      CustomerID    Y     Recency
0        2898197  1.0  2017-07-01
1        2767598  1.0  2017-04-07
2        2910374  1.0  2017-06-30
3        2743625  1.0  2017-06-29
4        2751226  1.0  2017-02-15
...          ...  ...         ...
9995     2904785  0.0  2015-08-08
9996     2832618  0.0  2017-04-08
9997     2751028  0.0  2015-01-30
9998     2889022  0.0  2016-08-29
9999     2744732  0.0  2016-02-16

[10000 rows x 3 columns]

In [48]:
new_df.Recency = pd.to_datetime('2017-07-01') - pd.to_datetime(new_df['Recency'])
new_df

      CustomerID    Y  Recency
0        2898197  1.0   0 days
1        2767598  1.0  85 days
2        2910374  1.0   1 days
3        2743625  1.0   2 days
4        2751226  1.0 136 days
...          ...  ...      ...
9995     2904785  0.0 693 days
9996     2832618  0.0  84 days
9997     2751028  0.0 883 days
9998     2889022  0.0 306 days
9999     2744732  0.0 501 days

[10000 rows x 3 columns]

In [49]:
new_df.Recency /=  np.timedelta64(1,'D')
new_df

      CustomerID    Y  Recency
0        2898197  1.0      0.0
1        2767598  1.0     85.0
2        2910374  1.0      1.0
3        2743625  1.0      2.0
4        2751226  1.0    136.0
...          ...  ...      ...
9995     2904785  0.0    693.0
9996     2832618  0.0     84.0
9997     2751028  0.0    883.0
9998     2889022  0.0    306.0
9999     2744732  0.0    501.0

[10000 rows x 3 columns]

In [50]:
group_ft = pre_grp[['CustomerID', 'RKDate']].groupby('CustomerID')['RKDate'].min()
group_ft

CustomerID
2728046    2015-01-01
2728088    2015-01-01
2728089    2015-01-01
2728095    2015-01-01
2728107    2015-01-01
              ...
2913103    2015-03-31
2913106    2015-03-31
2913114    2015-03-31
2913123    2015-03-31
2913132    2016-12-07
Name: RKDate, Length: 9939, dtype: object

In [51]:
group_ft=group_ft.to_frame()

In [52]:
group_ft.RKDate = (pd.to_datetime('2017-07-01') - pd.to_datetime(group_ft['RKDate'])) / np.timedelta64(1,'D')
group_ft

            RKDate
CustomerID
2728046      912.0
2728088      912.0
2728089      912.0
2728095      912.0
2728107      912.0
...            ...
2913103      823.0
2913106      823.0
2913114      823.0
2913123      823.0
2913132      206.0

[9939 rows x 1 columns]

In [53]:
group_frec = pre_grp[['CustomerID', 'RKDate']].groupby('CustomerID')['RKDate'].count()
group_frec

CustomerID
2728046     57
2728088     34
2728089     33
2728095     99
2728107     21
          ...
2913103     39
2913106    187
2913114    111
2913123    232
2913132     18
Name: RKDate, Length: 9939, dtype: int64

In [54]:
group_frec = group_frec.to_frame()

In [55]:
group_frec = group_frec.rename(columns = {"RKDate" : "tmp"})
group_frec

            tmp
CustomerID
2728046      57
2728088      34
2728089      33
2728095      99
2728107      21
...         ...
2913103      39
2913106     187
2913114     111
2913123     232
2913132      18

[9939 rows x 1 columns]

In [56]:
group_frec = pd.merge(group_frec, group_ft, how = 'left', on = 'CustomerID')
group_frec

            tmp  RKDate
CustomerID
2728046      57   912.0
2728088      34   912.0
2728089      33   912.0
2728095      99   912.0
2728107      21   912.0
...         ...     ...
2913103      39   823.0
2913106     187   823.0
2913114     111   823.0
2913123     232   823.0
2913132      18   206.0

[9939 rows x 2 columns]

In [57]:
group_frec["Frequency"] = group_frec.tmp * 30 / group_frec.RKDate
group_frec

            tmp  RKDate  Frequency
CustomerID
2728046      57   912.0   1.875000
2728088      34   912.0   1.118421
2728089      33   912.0   1.085526
2728095      99   912.0   3.256579
2728107      21   912.0   0.690789
...         ...     ...        ...
2913103      39   823.0   1.421628
2913106     187   823.0   6.816525
2913114     111   823.0   4.046173
2913123     232   823.0   8.456865
2913132      18   206.0   2.621359

[9939 rows x 3 columns]

In [58]:
group_frec = group_frec.reset_index()

In [59]:
group_frec = group_frec[['CustomerID', 'Frequency', 'tmp']]
group_frec

      CustomerID  Frequency  tmp
0        2728046   1.875000   57
1        2728088   1.118421   34
2        2728089   1.085526   33
3        2728095   3.256579   99
4        2728107   0.690789   21
...          ...        ...  ...
9934     2913103   1.421628   39
9935     2913106   6.816525  187
9936     2913114   4.046173  111
9937     2913123   8.456865  232
9938     2913132   2.621359   18

[9939 rows x 3 columns]

In [60]:
new_df = pd.merge(new_df, group_frec, how = 'outer', on = 'CustomerID')
new_df = new_df.fillna(0.0)
new_df

      CustomerID    Y  Recency  Frequency    tmp
0        2898197  1.0      0.0   5.042017  140.0
1        2767598  1.0     85.0   2.157534   63.0
2        2910374  1.0      1.0  28.145455  774.0
3        2743625  1.0      2.0   4.338154  130.0
4        2751226  1.0    136.0   0.437220   13.0
...          ...  ...      ...        ...    ...
9995     2904785  0.0    693.0   0.253317    7.0
9996     2832618  0.0     84.0   2.222222    8.0
9997     2751028  0.0    883.0   0.101351    3.0
9998     2889022  0.0    306.0   0.502793    6.0
9999     2744732  0.0    501.0   6.956522  208.0

[10000 rows x 5 columns]

In [61]:
group_mv = pre_grp[['CustomerID', 'SummAfterPointsUsage']].groupby('CustomerID')['SummAfterPointsUsage'].sum()
group_mv = group_mv.to_frame()
group_mv

            SummAfterPointsUsage
CustomerID
2728046                 14352.00
2728088                  9508.00
2728089                 13158.25
2728095                 26011.00
2728107                  8268.00
...                          ...
2913103                 17298.00
2913106                 47308.00
2913114                 34618.00
2913123                 29982.00
2913132                  6664.00

[9939 rows x 1 columns]

In [62]:
group_mv = group_mv.reset_index()
group_mv

      CustomerID  SummAfterPointsUsage
0        2728046              14352.00
1        2728088               9508.00
2        2728089              13158.25
3        2728095              26011.00
4        2728107               8268.00
...          ...                   ...
9934     2913103              17298.00
9935     2913106              47308.00
9936     2913114              34618.00
9937     2913123              29982.00
9938     2913132               6664.00

[9939 rows x 2 columns]

In [63]:
new_df = pd.merge(new_df, group_mv, how = 'outer', on = 'CustomerID')
new_df = new_df.fillna(0.0)
new_df

      CustomerID    Y  Recency  Frequency    tmp  SummAfterPointsUsage
0        2898197  1.0      0.0   5.042017  140.0              51591.00
1        2767598  1.0     85.0   2.157534   63.0              13738.01
2        2910374  1.0      1.0  28.145455  774.0             347117.50
3        2743625  1.0      2.0   4.338154  130.0              34004.00
4        2751226  1.0    136.0   0.437220   13.0               2552.00
...          ...  ...      ...        ...    ...                   ...
9995     2904785  0.0    693.0   0.253317    7.0               3694.00
9996     2832618  0.0     84.0   2.222222    8.0               3400.00
9997     2751028  0.0    883.0   0.101351    3.0                735.00
9998     2889022  0.0    306.0   0.502793    6.0               1233.00
9999     2744732  0.0    501.0   6.956522  208.0              33999.00

[10000 rows x 6 columns]

In [64]:
new_df["Monetary Value"] = new_df.SummAfterPointsUsage / new_df.tmp
new_df

,CustomerID,Y,Recency,Frequency,tmp,SummAfterPointsUsage,Monetary Value
0,2898197,1.0,0.0,5.042017,140.0,51591.00,368.507143
1,2767598,1.0,85.0,2.157534,63.0,13738.01,218.063651
2,2910374,1.0,1.0,28.145455,774.0,347117.50,448.472222
3,2743625,1.0,2.0,4.338154,130.0,34004.00,261.569231
4,2751226,1.0,136.0,0.437220,13.0,2552.00,196.307692
...,...,...,...,...,...,...,...
9995,2904785,0.0,693.0,0.253317,7.0,3694.00,527.714286
9996,2832618,0.0,84.0,2.222222,8.0,3400.00,425.000000
9997,2751028,0.0,883.0,0.101351,3.0,735.00,245.000000
9998,2889022,0.0,306.0,0.502793,6.0,1233.00,205.500000
9999,2744732,0.0,501.0,6.956522,208.0,33999.00,163.456731

In [65]:
new_df = new_df.fillna(0.0)
new_df = new_df[['CustomerID', 'Y', 'Recency', 'Frequency', 'Monetary Value']]
new_df

      CustomerID    Y  Recency  Frequency  Monetary Value
0        2898197  1.0      0.0   5.042017      368.507143
1        2767598  1.0     85.0   2.157534      218.063651
2        2910374  1.0      1.0  28.145455      448.472222
3        2743625  1.0      2.0   4.338154      261.569231
4        2751226  1.0    136.0   0.437220      196.307692
...          ...  ...      ...        ...             ...
9995     2904785  0.0    693.0   0.253317      527.714286
9996     2832618  0.0     84.0   2.222222      425.000000
9997     2751028  0.0    883.0   0.101351      245.000000
9998     2889022  0.0    306.0   0.502793      205.500000
9999     2744732  0.0    501.0   6.956522      163.456731

[10000 rows x 5 columns]

In [66]:
mcos = cos[['CustomerID', 'Age', 'Sex']]
mcos

      CustomerID    Age     Sex
0        2728183   21.0  Female
1        2728198   21.0  Female
2        2728306   21.0  Female
3        2728178   22.0    Male
4        2728322   22.0    Male
...          ...    ...     ...
9995     2912655   49.0  Female
9996     2912502   52.0    Male
9997     2912767   52.0    Male
9998     2912383   60.0    Male
9999     2912304  118.0     NaN

[10000 rows x 3 columns]

In [67]:
mcos.Sex = mcos.Sex.fillna('Male')
mcos

      CustomerID    Age     Sex
0        2728183   21.0  Female
1        2728198   21.0  Female
2        2728306   21.0  Female
3        2728178   22.0    Male
4        2728322   22.0    Male
...          ...    ...     ...
9995     2912655   49.0  Female
9996     2912502   52.0    Male
9997     2912767   52.0    Male
9998     2912383   60.0    Male
9999     2912304  118.0    Male

[10000 rows x 3 columns]

In [68]:
mcos.Age = mcos.Age.fillna(mcos.Age.mean())
mcos

      CustomerID    Age     Sex
0        2728183   21.0  Female
1        2728198   21.0  Female
2        2728306   21.0  Female
3        2728178   22.0    Male
4        2728322   22.0    Male
...          ...    ...     ...
9995     2912655   49.0  Female
9996     2912502   52.0    Male
9997     2912767   52.0    Male
9998     2912383   60.0    Male
9999     2912304  118.0    Male

[10000 rows x 3 columns]

In [69]:
new_df = pd.merge(new_df, mcos, how = 'inner', on = 'CustomerID')
new_df = new_df.fillna(0.0)
new_df

      CustomerID    Y  Recency  Frequency  Monetary Value   Age     Sex
0        2898197  1.0      0.0   5.042017      368.507143  33.0  Female
1        2767598  1.0     85.0   2.157534      218.063651  29.0    Male
2        2910374  1.0      1.0  28.145455      448.472222  60.0    Male
3        2743625  1.0      2.0   4.338154      261.569231  40.0    Male
4        2751226  1.0    136.0   0.437220      196.307692  46.0    Male
...          ...  ...      ...        ...             ...   ...     ...
9995     2904785  0.0    693.0   0.253317      527.714286  22.0    Male
9996     2832618  0.0     84.0   2.222222      425.000000  21.0    Male
9997     2751028  0.0    883.0   0.101351      245.000000  32.0  Female
9998     2889022  0.0    306.0   0.502793      205.500000  29.0  Female
9999     2744732  0.0    501.0   6.956522      163.456731  50.0    Male

[10000 rows x 7 columns]